/*
// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.Write("Введите число a - ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число b - ");
int b = Convert.ToInt32(Console.ReadLine());

if (a>b)
{
    Console.WriteLine("Максимальное число = " + a);
}
else
{
    Console.WriteLine("Максимальное число = " + b);
}
*/



/*
// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.Write("Введите число a = ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число b = ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число c = ");
int c = Convert.ToInt32(Console.ReadLine());
*/



/*
// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

Console.Write("Введите число - ");
int a = Convert.ToInt32(Console.ReadLine());

if (a % 2 == 0)
{
    Console.Write($"Число {a} чётное");
}
else
{
    Console.Write($"Число {a} нечётное");
}
*/



/*
//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

Console.Write("Введите число N = ");
int N = Convert.ToInt32(Console.ReadLine());

int num = 2;

while(num <= N)
{
    Console.Write(num + " ");
    num += 2;
}
*/