// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*
int numbers (int num)
{
    int a = num / 10;
    int b = a % 10;
    return b;
}

Console.Write("Введите любое 3-х значное число - ");
int num = Convert.ToInt32(Console.ReadLine());

int result = numbers (num);

Console.WriteLine($"New version of a numbers {num} number in the middle {result}");
*/